# AddPoint

## Description
Procedure AddPoint adds a vertex point to a newly created polygon. AddPoint is designed to be used with BeginPoly and EndPoly to define new polygon objects via VectorScript.

```pascal
PROCEDURE AddPoint(px,py : REAL);
```

```python
def vs.AddPoint(p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|px|REAL|X Coordinates of vertex.|
|py|REAL|Y Coordinates of vertex.|

## Examples
==== VectorScript ====
```pascal
BeginPoly;
AddPoint(0,0);
AddPoint(2,0);
AddPoint(2,2);
AddPoint(1,3);
AddPoint(0,2);
AddPoint(0,0);
EndPoly;
{creates a polygon object}

BeginPoly;
AddPoint(x,y);
x := x + 1;
y := y + 1;
AddPoint(x,y);
x:= x + 1;
y := y - 1;
AddPoint(x,y);
EndPoly;
{creates a polygon with vertices as calculated}
```
==== Python ====
```python
vs.BeginPoly()
vs.AddPoint(0,0)
vs.AddPoint(2,0)
vs.AddPoint(2,2)
vs.AddPoint(1,3)
vs.AddPoint(0,2)
vs.AddPoint(0,0)
vs.EndPoly()
#{creates a polygon object}
```

## See Also
<listTable indent="1" cols="4">
AddPoint|AddPoint
ArcTo|ArcTo
BeginPoly|BeginPoly
ClosePoly|ClosePoly
CurveThrough|CurveThrough
CurveTo|CurveTo
DelVertex|DelVertex
EndPoly|EndPoly
GetHole|GetHole
GetNumHoles|GetNumHoles
GetPolylineVertex|GetPolylineVertex
GetPolyPt|GetPolyPt
GetVertexVisibility|GetVertexVisibility
GetVertNum|GetVertNum
InsertVertex|InsertVertex
OpenPoly|OpenPoly
Poly|Poly
SetPolylineVertex|SetPolylineVertex
SetPolyPt|SetPolyPt
SetVertexVisibility|SetVertexVisibility
Smooth|Smooth
</listTable>

## Version
Availability: from All Versions

## Category
* Objects - Polys